In [9]:
import pandas as pd
import numpy as np

In [102]:
df1=pd.read_csv('Train.csv')
df1.fillna(0,inplace=True)

In [103]:
df1.head()

,BillNo,Date,Customer,Discount 5%,Discount 12%,Discount 18%,Discount 28%
0,ZA8180,01-04-2017,"TIRUVALLA MEDICAL MISSION, THIRUVALLA",0.0,0.0,0.0,1.0
1,ZA8169,01-04-2017,"BELIEVERS CHURCH, MEDICAL COLLEGE HOSPITAL",0.0,0.0,1.0,0.0
2,ZA8177,01-04-2017,"KADAVIL MEDICALS, MANNAR",0.0,0.0,0.0,1.0
3,ZA8172,01-04-2017,"S.N.MEDICALS, KADAPRA",0.0,0.0,0.0,1.0
4,ZA8173,01-04-2017,"BHARATH MEDICALS, KIZHAKENMUTTOOR",0.0,0.0,0.0,1.0

In [104]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14021 entries, 0 to 14020
Data columns (total 7 columns):
BillNo          14021 non-null object
Date            14021 non-null object
Customer        14021 non-null object
Discount 5%     14021 non-null float64
Discount 12%    14021 non-null float64
Discount 18%    14021 non-null float64
Discount 28%    14021 non-null float64
dtypes: float64(4), object(3)
memory usage: 766.9+ KB

In [105]:
df2=pd.read_csv('Product_sales_train_and_test.csv')
df2.head()

   BillNo                                    Customer_Basket
0  A10455  [1511 1046 1084 1730 1806 1316 1186 1418 1088 ...
1  A11277                    [1188 1226 1284 1406 1025 1769]
2  A10842  [1575 1064 1444 1314 1454 1247 1506 1354 1541 ...
3   A1572  [1131 1101 1676 1206 1300 1384 1439 1667 1567 ...
4  A10924  [1592 1320 1536 1775 1715 1447 1585 1322 1687 ...

In [106]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14091 entries, 0 to 14090
Data columns (total 2 columns):
BillNo             14091 non-null object
Customer_Basket    14091 non-null object
dtypes: object(2)
memory usage: 220.2+ KB

In [118]:
df2[df2['BillNo'] == 'ZA8173'].index

Int64Index([12302], dtype='int64')

In [119]:
df2.iloc[12302]

BillNo          ZA8173
data      [1005, 1152]
Name: 12302, dtype: object

In [109]:
def num(ar):
    ar1=list(ar.split("["))
    ar2=list(ar1[1].split("]"))
    return list(ar2[0].split(" "))
    
df2['data']=df2['Customer_Basket'].apply(num)
df2.head()

,BillNo,Customer_Basket,data
0,A10455,[1511 1046 1084 1730 1806 1316 1186 1418 1088 ...,"[1511, 1046, 1084, 1730, 1806, 1316, 1186, 141..."
1,A11277,[1188 1226 1284 1406 1025 1769],"[1188, 1226, 1284, 1406, 1025, 1769]"
2,A10842,[1575 1064 1444 1314 1454 1247 1506 1354 1541 ...,"[1575, 1064, 1444, 1314, 1454, 1247, 1506, 135..."
3,A1572,[1131 1101 1676 1206 1300 1384 1439 1667 1567 ...,"[1131, 1101, 1676, 1206, 1300, 1384, 1439, 166..."
4,A10924,[1592 1320 1536 1775 1715 1447 1585 1322 1687 ...,"[1592, 1320, 1536, 1775, 1715, 1447, 1585, 132..."

In [110]:
def conv(lis):
    for i in range(len(lis)):
        i= int(i)
    return lis
    
df2['data'].apply(conv)
df2.head()

,BillNo,Customer_Basket,data
0,A10455,[1511 1046 1084 1730 1806 1316 1186 1418 1088 ...,"[1511, 1046, 1084, 1730, 1806, 1316, 1186, 141..."
1,A11277,[1188 1226 1284 1406 1025 1769],"[1188, 1226, 1284, 1406, 1025, 1769]"
2,A10842,[1575 1064 1444 1314 1454 1247 1506 1354 1541 ...,"[1575, 1064, 1444, 1314, 1454, 1247, 1506, 135..."
3,A1572,[1131 1101 1676 1206 1300 1384 1439 1667 1567 ...,"[1131, 1101, 1676, 1206, 1300, 1384, 1439, 166..."
4,A10924,[1592 1320 1536 1775 1715 1447 1585 1322 1687 ...,"[1592, 1320, 1536, 1775, 1715, 1447, 1585, 132..."

In [111]:
df2.drop(columns=['Customer_Basket'],inplace=True)
df2.head()

   BillNo                                               data
0  A10455  [1511, 1046, 1084, 1730, 1806, 1316, 1186, 141...
1  A11277               [1188, 1226, 1284, 1406, 1025, 1769]
2  A10842  [1575, 1064, 1444, 1314, 1454, 1247, 1506, 135...
3   A1572  [1131, 1101, 1676, 1206, 1300, 1384, 1439, 166...
4  A10924  [1592, 1320, 1536, 1775, 1715, 1447, 1585, 132...

In [115]:
df =df1.merge(df2,on='BillNo')

In [123]:
def ln(ar):
    return len(ar)
    
df['len'] = df['data'].apply(ln)

In [165]:
df3 = df.drop(['Date','Customer','data'],axis=1)
df3.head(20)

    BillNo  Discount 5%  Discount 12%  Discount 18%  Discount 28%  len
0   ZA8180          0.0           0.0           0.0           1.0   16
1   ZA8169          0.0           0.0           1.0           0.0   12
2   ZA8177          0.0           0.0           0.0           1.0    5
3   ZA8172          0.0           0.0           0.0           1.0   63
4   ZA8173          0.0           0.0           0.0           1.0    2
5   ZA8181          0.0           0.0           0.0           1.0   75
6   ZA8183          0.0           0.0           0.0           1.0   56
7   ZA8182          0.0           0.0           0.0           1.0   58
8   ZA8176          0.0           0.0           0.0           1.0   50
9   ZA8168          0.0           0.0           0.0           1.0   43
10  ZA8171          0.0           0.0           0.0           1.0   67
11  ZA8179          0.0           0.0           0.0           1.0   16
12  ZA8184          0.0           0.0           0.0           1.0   23
13  ZA8190          0.0           0.0           0.0           1.0   63
14  ZA8200          0.0           0.0           0.0           1.0   30
15  ZA8195          0.0           0.0           0.0           1.0   62
16  ZA8201          0.0           0.0           0.0           1.0   70
17  ZA8198          0.0           0.0           0.0           1.0   16
18  ZA8189          0.0           0.0           0.0           1.0   79
19  ZA8199          0.0           0.0           0.0           1.0   51

In [ ]:
for index, row in df.iterrows():
    if df['Discount 5%']==1:
        df['clus'][row] =0

In [120]:
from sklearn.preprocessing import StandardScaler

In [121]:
scaler = StandardScaler()
scaler.fit(df[['len'])

In [154]:
from sklearn.cluster import KMeans
kmeans = KMeans(n_clusters=4)
kmeans.fit(np.array(df3['len']).reshape(-1,1))

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
    n_clusters=4, n_init=10, n_jobs=1, precompute_distances='auto',
    random_state=None, tol=0.0001, verbose=0)

In [140]:
df4 = pd.read_csv('product_detail.csv')
df4.head()

   Product_ID    Product_Name   Pack Unnamed: 3
0        1001       Cyclomeff   10 S        NaN
1        1002       EfelinPD   100ml        NaN
2        1003  Febrex 125 Syp   60ml        NaN
3        1004  Febrex 250 Syp   60ml        NaN
4        1005  Febrex 650 Tab   10 S        NaN

In [142]:
df4['Pack'].nunique()

94

In [162]:
d =pd.DataFrame(kmeans.labels_)
d

       0
0      0
1      0
2      0
3      3
4      0
5      3
6      1
7      1
8      1
9      1
10     3
11     0
12     2
13     3
14     2
15     3
16     3
17     0
18     3
19     1
20     2
21     1
22     2
23     1
24     0
25     2
26     3
27     1
28     1
29     2
...   ..
12170  1
12171  2
12172  3
12173  2
12174  3
12175  0
12176  1
12177  2
12178  2
12179  0
12180  1
12181  2
12182  3
12183  2
12184  3
12185  0
12186  3
12187  3
12188  2
12189  0
12190  1
12191  0
12192  1
12193  2
12194  3
12195  0
12196  3
12197  0
12198  0
12199  3

[12200 rows x 1 columns]

In [157]:
df3.columns

Index(['BillNo', 'Discount 5%', 'Discount 12%', 'Discount 18%', 'Discount 28%',
       'len'],
      dtype='object')

In [159]:
y = df[['Discount 5%', 'Discount 12%', 'Discount 18%', 'Discount 28%']]

In [160]:
from sklearn.metrics import confusion_matrix,classification_report
print(confusion_matrix(y,kmeans.labels_))
print(classification_report(y,kmeans.labels_))

ValueError: Classification metrics can't handle a mix of multilabel-indicator and multiclass targets